Revit 2027 API
RenderingQualitySettings.RenderDuration Property
 A value that controls render duration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RenderDuration RenderDuration { get; set; }
Public Property RenderDuration As RenderDuration
	Get
	Set
public:
property RenderDuration RenderDuration {
	RenderDuration get ();
	void set (RenderDuration value);
}
member RenderDuration : RenderDuration with get, set
Property Value
RenderDuration
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value is not valid for RenderDuration. -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Remarks
 The duration of rendering.
See Also
Reference
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace